Repository: autohotkey-docs-translation/v1-fr
Catalog: omegat/project_save.tmx
Source language: en
Languages: fr

source: For a description of how dynamic variable references inside functions are resolved, see Functions:
fr: Pour une description de comment les références dynamiques de variable dans les fonctions sont résolues, voir Fonctions :

source: For a general explanation of control flow, see Control Flow.
fr: Pour une explication générale du flux de contrôle, voir Flux de Contrôle.

source: For a general explanation of functions and related terminology, see Functions/Commands.
fr: Pour une explication générale des fonctions et la terminologie associée, voir Fonctions/Commandes.

source: For a list of all built-in commands, function and variables, see section 5.
fr: Pour une liste de toutes les commandes, fonctions et variables intégrées, voir la section 5.

source: For a list of valid numeric codepage identifiers, see MSDN.
fr: Pour une liste des identificateurs numériques valides de codepage, voir MSDN.

source: For a more general explanation of strings, see Strings.
fr: Pour une explication plus générale des chaînes de caractères, voir Chaînes de caractères.

source: For a video instruction, watch Install and Hello World on YouTube.
fr: Pour des instructions en vidéo, regarder Install and Hello World sur YouTube.

source: For an example, see ExecScript().
fr: Pour un exemple, voir ExecScript().

source: For clarity, it is best to always escape any comma which is intended to be literal, but escaping comma is optional in the following cases:
fr: Par simplicité, il est mieux de toujours échapper une virgule censée être littérale, mais l'échappement de virgule est facultatif dans les cas suivants :

source: For command-line installations, specify /uiAccess or /uiAccess=1 to enable the option and /uiAccess=0 to disable it.
fr: Pour les installations en ligne de commande, spécifier /uiAccess ou /uiAccess=1 active l'option et /uiAccess=0 la désactive.

source: For complex scripts, see Interactive Debugging.
fr: Pour des scripts complexes, voir Déboguage Interactif.

source: For details such as maximum length and usable characters, see Names.
fr: Pour des détails comme la longueur maximale et les caractères utilisables, voir Noms.

source: For details, see "Known limitations" under Assign in the table of operators.
fr: Pour les détails, voir "Limitations connues" sous Affectation dans le tableau des opérateurs.

source: For details, see Libraries of Functions.
fr: Pour les détails, voir Bibliothèques de Fonctions.

source: For details, see The Top of the Script.
fr: Pour les détails, voir Le Haut du Script.

source: For details, see Functions:
fr: Pour les détails, voir Fonctions :

source: For details, see Using Subroutines Within a Function.
fr: Pour les détails, voir Utilisation de Sous-Programmes Dans une Fonction.

source: For details, see auto-execute section.
fr: Pour des détails, voir section d'auto-exécution.

source: For details, see the FAQ.
fr: Pour plus de détails, voir la FAQ.

source: For each script file which is auto-included via the library mechanism, two lines are written to the file specified by OutFile.
fr: Pour chaque fichier de script auto-inclus via le mécanisme de bibliothèque, deux lignes sont écrites dans le fichier spécifié par FichierSortie.

source: For example, 2joy1 is the second joystick's first button.
fr: Par exemple, 2joy1 est le premier bouton du deuxième joystick.

source: For example, #Space is Win+Space and ^!Tab is Control+Alt+Tab.
fr: Par exemple, #Space est Win+Espace et ^!Tab est Ctrl+Alt+Tabulation.

source: For example, (Join: is treated as the label "(Join" and (LTrim Join: is unsupported, but (Join:
fr: Par exemple, (Join: est vu comme le label "(Join" et (LTrim Join: n'est pas pris en charge, mais (Join:

source: For example, ComObjActive("Word.Application") will fail because Word is not marked for UI Access.
fr: Par exemple, ComObjActive("Word.Application") ne fonctionnera pas car Word n'est pas marqué UI Access.

source: For example, MsgBox< foo and If!foo are not tolerated.
fr: Par exemple, MsgBox <foo et If!foo ne sont pas tolérés.

source: For example, MyArray%A_Index% or MyGrid%X%_%Y%.
fr: Par exemple, MonTableau%A_Index% ou MaGrille%X%_%Y%.

source: For example, MyFunc()+1 is currently allowed, although the +1 has no effect and its result is discarded.
fr: Par exemple, MaFonc()+1 est actuellement autorisé, bien que +1 n'ait aucun effet et que le résultat soit ignoré.

source: For example, Round can be both a variable name and a function name, and Round := 1 will not affect Round(n) in any way.
fr: Par exemple, Round peut être à la fois un nom de variable et un nom de fonction, et Round := 1 n'aura aucun effet d'aucune sorte sur Round(n).

source: For example, x-y performs subtraction while -x inverts the sign of x (producing a positive value from a negative value and vice versa).
fr: Par exemple, x-y effectue une soustraction alors que -x change le signe de x (produisant une valeur positive à partir d'une valeur négative et vice versa).

source: For example, -x or not keyIsDown.
fr: Par exemple, -x ou not toucheEnfoncee.

source: For example, 1+1 or 2 * 5.
fr: Par exemple, 1+1 ou 2 * 5.

source: For example, A_ScreenWidth/2.
fr: Par exemple, A_ScreenWidth/2.

source: For example, MsgBox ? 1 : 0 shows a message box.
fr: Par exemple, MsgBox ? 1 : 0 affiche une boîte de dialogue.

source: For example, Send, +abC would send the text "AbC", and Send, !+a would press Alt+Shift+A.
fr: Par exemple, Send, +abC enverrait le texte "AbC", et Send, !+a appuierait sur Alt+Shift+A.

source: For example, Send, This is text!a would send the keys "This is text" and then press Alt+A.
fr: Par exemple, Send, Ceci est du texte !a enverrait les touches "This is text" puis appuierait sur Alt+A.

source: For example, The year is %A_Year%.
fr: Par exemple, L'année est %A_Year%.

source: For example, ExcelApp.Quit, xxx is prohibited due to the apparent similarity to command syntax.
fr: Par exemple, ExcelApp.Quit, xxx est interdit à cause de la similitude apparente avec la syntaxe des commandes.

source: For example, Send, ^!a would press Ctrl+Alt+A, and Send, ^{Home} would send Ctrl+Home.
fr: Par exemple, Send, ^!a appuierait sur Ctrl+Alt+A, et Send, ^{Home} enverrait Ctrl+Home.

source: For example, `% produces a literal percent sign and `, produces a literal comma.
fr: Par exemple, `% produit un signe pourcent littéral et `, produit une virgule littérale.

source: For example, if(expression).
fr: Par exemple, if(expression).

source: For example, Join`s would insert a space after each line except the last ("`s" indicates a literal space -- it is a special escape sequence recognized only by Join).
fr: Par exemple, Join`s insèrerait un espace après chaque ligne sauf la dernière ("`s" indique un espace littéral -- il s'agit d'une séquence d'échappement spéciale reconnue seulement par Join).

source: For example, {A:
fr: Par exemple, {A:

source: For example, "This is a quoted string.".
fr: Par exemple, "Ceci est une chaîne entre guillemets.".

source: For example, a::b creates hotkeys and labels for *a and *a Up, and does not create a label named a.
fr: Par exemple, a::b créé des hotkeys et des labels pour *a et *a Up, et ne créé pas de label nommé a.

source: For example, 10, 1+1 and MyVar are valid expressions.
fr: Par exemple, 10, 1+1 et MaVar sont des expressions valides.

source: For example, 3 + 2 * 2 is evaluated as 3 + (2 * 2).
fr: Par exemple, 3 + 2 * 2 est évalué comme 3 + (2 * 2).

source: For example, vk1Bsc001:: raises an error in v1.1.27+, but sc001 was ignored (had no effect) in previous versions.
fr: Par exemple, vk1Bsc001:: génère une erreur dans v1.1.27+, mais sc001 a été ignoré (sans effet) dans les versions précédentes.

source: For example, GetKeyState("Shift") returns (evaluates to) 1 if the Shift key is being held down or 0 otherwise.
fr: Par exemple, GetKeyState("Shift") renvoie (est évalué à) 1 si la touche Shift (majuscule) est enfoncée et 0 sinon.

source: For example, A_LoopField returns the current substring in the innermost parsing loop, even if it is used inside a file or registry loop.
fr: Par exemple, A_LoopField renvoie la sous-chaîne actuelle dans la boucle Loop Parse la plus intérieure, même au sein d'une boucle sur des fichiers ou le registre.

source: For example, a line consisting of just 21*2 or "Some text" wouldn't make any sense.
fr: Par exemple, une ligne avec seulement 21*2 ou "Du texte" n'auraient aucun sens.

source: For example, all of the following are effectively identical because Sleep's first parameter is expression-capable:
fr: Par exemple, les lignes suivantes sont en réalité identiques puisque le premier paramètre de Sleep utilise les expressions :

source: For example, if Discount/100 converts a discount percentage to a fraction, 1 - Discount/100 calculates a fraction representing the remaining amount, and Price * (1 - Discount/100) applies it to produce the net price.
fr: Par exemple, si Reduction/100 convertit un pourcentage de réduction en fraction, 1 - Reduction/100 calcule une fraction représentant le montant restant, et Prix * (1 - Reduction/100) l'applique pour obtenir le prix net.

source: For example, if you are running AutoHotkeyU32.exe, look for AutoHotkeyU32.ahk.
fr: Par exemple, en cas d'utilisation de AutoHotkeyU32.exe, cherche AutoHotkeyU32.ahk.

source: For example, if you configure a mystery key to send Control+F1, you can then indirectly make that key as a hotkey by using ^F1:: in a script.
fr: Par exemple, si vous configurez une touche mystère pour envoyer Contrôle+F1, vous pouvez alors indirectement faire de cette touche un hotkey en utilisant ^ F1::

source: For example, if you configure the fourth button to send Control+F1, you can then indirectly configure that button as a hotkey by using ^F1:: in a script.
fr: Par exemple, si le quatrième bouton est configuré pour envoyer Ctrl+F1, ce bouton peut être indirectement configuré via une hotkey ^F1:: dans un script.

source: For example, if you rename AutoHotkey.exe to MyScript.exe, it will attempt to find MyScript.ahk.
fr: Par exemple, en renommant AutoHotkey.exe en MonScript.exe, le programme cherchera MonScript.ahk.

source: For example, the Run command can accept between one and four parameters.
fr: Par exemple, la commande Run peut accepter entre un et quatre paramètres.

source: For example, the expression GetKeyState("Shift", "P") and GetKeyState("Ctrl", "P") returns 1 only if both keys are being physically held down.
fr: Par exemple, l'expression GetKeyState("Shift", "P") and GetKeyState("Ctrl", "P") renvoie 1 quand les deux touches majuscule et contrôle sont physiquement enfoncées.

source: For example, the expression 1+1 evaluates to the number 2.
fr: Par exemple, l'expression 1+1 est évaluée au nombre 2.

source: For example, the following are equivalent:
fr: Par exemple, les lignes suivantes sont équivalentes :

source: For example, the following hotkey does not use the keyboard hook, but as a side-effect it is triggered by pressing either Home or NumpadHome:
fr: Par exemple, le hotkey suivant n'utilise pas le hook clavier, mais comme effet secondaire, il est déclenché en appuyant sur soit Début ou PavnumDébut:

source: For example, the following installs silently and sets ANSI 32-bit as the default:
fr: Par exemple, ceci réalise silencieusement l'installation et définit ANSI 32-bit comme version par défaut :

source: For example, the following two lines, when temporarily inserted at carefully chosen positions, create "break points" in the script:
fr: Par exemple, les deux lignes suivantes, insérées temporairement à des endroits choisis soigneusement, crééent des "points d'arrêt" dans le script :

source: For example, the third parameter of StringLower shown above accepts the letter T as text.
fr: Par exemple, le troisième paramètre de StringLower montrée ci-dessus accepte le texte T.

source: For example:
fr: Par exemple :

source: For further assistance, post on the forums.
fr: Pour plus d'aide, demander sur les forums.

source: For further explanation of how percent signs are used, see Legacy Syntax and Dynamic Variables.
fr: Pour des explications plus poussées de comment utiliser les signes pourcentage, voir Syntaxe Dépassée et Variables Dynamiques.

source: For historical reasons, simple variable references alone or combined with digits are not interpreted as expressions.
fr: Pour raisons historiques, des références de variable seules ou combinées avec des chiffres ne sont pas interprétées comme des expressions.

source: For instance, MyScript.exe automatically runs MyScript.ahk if a filename is not supplied, but is also capable of running other scripts.
fr: Par exemple, MonScript.exe exécute automatiquement MonScript.ahk si un nom de fichier n'est pas fourni, mais est aussi capable d'exécuter d'autres scripts.

source: For instance, if you've got a new computer, it might have different drivers or other software installed.
fr: Par exemple, en cas de changement d'ordinateur, d'autres drivers ou logiciels peuvent être installés.

source: For instance:
fr: Par exemple :

source: For more details, see Enable interaction with administrative programs on the archive forum.
fr: Pour plus de détails, voir Enable interaction with administrative programs (Activer les interactions avec les programmes administrateur) sur l'archive du forum.

source: For more details, see Labels.
fr: Pour plus de détails, voir Labels.

source: For more details, see Interactive Debugging.
fr: Pour plus de détails, voir Débogage Interactif.

source: For more details, see Script File Codepage.
fr: Pour plus de détails, voir Codepage de Fichier de Script.

source: For more in-depth information and examples, check out the Run page.
fr: Pour plus d'informations et d'examples, voir la page Run.

source: For more in-depth information and similar commands, check out the #IfWinActive page.
fr: Pour plus de détails et de commandes similaires, voir la page #IfWinActive.

source: For more information about the VKnn method, see Special Keys.
fr: Pour plus d'informations sur la méthode VKnn, veulliez voir Touches spéciales.

source: For more information on what each one does, read this.
fr: Pour plus de détails sur ce que fait chaque commande, lire ceci.

source: For more information, read about Continuation Sections.
fr: Pour de plus amples informations, lire Continuation Sections.

source: For optimal learning power, it is advised that you read the text and try the code.
fr: Pour un apprentissage optimal, il est recommandé de lire le texte et d'essayer le code.

source: For possible solutions, see further below.
fr: Pour des solutions possibles, veulliez voir ci-dessous.

source: For simple scripts, see Debugging a Script.
fr: Pour des scripts simples, voir Déboguer un Script.

source: For some loop types, other built-in variables return information about the current loop item (registry key/value, file, substring or line of text).
fr: Pour certains types de boucle, d'autres variables intégrées renvoient des informations sur l'élément actuel de la boucle (clé/valeur de registre, fichier, sous-chaîne ou ligne de texte).

source: For the last three cases, := should have been used instead of =.
fr: Pour les trois derniers cas, := devrait être utilisé à la place de =.

source: For the second time, it contains 2; and so on.
fr: La deuxième fois, elle contient 2 ; et ainsi de suite.

source: For these reasons, it is generally recommended to use normal arrays instead, where possible.
fr: Pour ces raisons, il est généralement recommandé d'utiliser à la place les tableaux normaux, si possible.

source: For this guide we will use the Installer since it is easiest to set up.
fr: Dans ce guide sera utilisé l'installateur puisque c'est la méthode la plus simple.

source: Forward
fr: Page suivante

source: Frequently Asked Questions (FAQ)
fr: Foire Aux Questions (FAQ)

source: Frequently Asked Questions (FAQ) | AutoHotkey
fr: Foire Aux Questions (FAQ) | AutoHotkey

source: Frequently asked questions
fr: Questions fréquentes

source: Function Calls
fr: Appels de Fonction

source: Function Keys
fr: Touches de Fonction

source: Function calls such as MyFunc(Params).
fr: Les appels de fonction comme MaFonc(Params).

source: Function names are always global, and are separate to variable names.
fr: Les noms de fonction sont toujours globaux, et sont séparés des noms de variable.

source: Function(Parameter1, Parameter2, Parameter3)
fr: Fonction(Parametre1, Parametre2, Parametre3)

source: Functions
fr: Fonctions

source: Functions are defined using syntax resembling a function call followed by a block of code enclosed in braces:
fr: Les fonctions sont définies en utilisant une syntaxe ressemblant à l'appel d'une fonction suivi d'un bloc de code entre accolades :

source: Functions can go inside of functions:
fr: Les fonctions peuvent aller dans d'autres fonctions :

source: Functions have a few main differences:
fr: Les fonctions ont quelques principales différences :

source: Games
fr: Jeux

source: General Buttons
fr: Boutons Générales

source: General Conventions
fr: Conventions Générales

source: General Keys
fr: Touches générales

source: General Troubleshooting
fr: Dépannage Général

source: General explanation of various concepts utilised by AutoHotkey.
fr: Explication générale de différents concepts utilisés par AutoHotkey.

source: Generally speaking, a function is a kind of subroutine.
fr: De manière générale, une fonction est un genre de sous-programme.

source: Generally, aside from whitespace and comments, no other code can be written on the same line as a label.
fr: En général, à part les espacements et les commentaires, aucun code supplémentaire ne peut être écrit sur la même ligne qu'un label.

source: Getting Started
fr: Pour Commencer

source: Getting started:
fr: Pour commencer:

source: Getting user input
fr: Entrée utilisateur

source: Give as much information as you can to educate us doorknobs at what you are trying to do.
fr: Donner autant d'informations que possible pour éclairer les ignorants sur l'objectif recherché.

source: Give the script a new name.
fr: Donner un nouveau nom au script.

source: GivenPath := %A_Index%
fr: CheminDonné := %A_Index%

source: Go get some reward snacks then return to reading the rest of this tutorial.
fr: Après quelques récompenses gustatives, il restera la lecture du reste de ce tutoriel.

source: Go into your harddrive that contains AutoHotkey.
fr: Aller dans le disque contenant AutoHotkey.

source: Go to the AutoHotkey Homepage:
fr: Aller sur la page d'accueil de AutoHotkey :

source: Go to your desktop.
fr: Aller sur le bureau.

source: GroupActivate sets ErrorLevel and GroupAdd's Label works differently
fr: GroupActivate définit ErrorLevel et Label de GroupAdd fonctionne différemment

source: GroupAdd with a blank group name.
fr: GroupAdd avec un nom de groupe vide.

source: Gui +Owner overrides additional styles
fr: Gui + Owner remplace les styles supplémentaires

source: Gui option +LastFoundExist must not be combined with another option, since that would cause it to act the same as +LastFound.
fr: L'option de l'interface graphique +LastFoundExist ne doit pas être combinée avec une autre option, car cela la ferait agir de la même manière que +LastFound.

source: Gui, Add, Button,, Submit
fr: Gui, Add, Button,, ENVOYER

source: Gui, Add, Edit, r9 vMyEdit w135, Text to appear inside the edit control (omit this parameter to start off empty).
fr: Gui, Add, Edit, r9 vMyEdit w135, Texte à apparaître dans le contrôle d'édition (omettez ce paramètre pour commencer vide).

source: Gui, Add, Edit, vAssociatedVar
fr: Gui, Add, Edit, vVarAssociee

source: Gui, Add, Text,, Enter some Text and press Submit:
fr: Gui, Add, Text,, Entrez du texte et cliquez sur ENVOYER :

source: Gui, Add, Text,, Please enter your name:
fr: Gui, Add, Text,, S'il vous plaît veuillez entrer votre nom:

source: Hand-held Remote Controls
fr: Télécommandes portables

source: Help - Open the AutoHotkey offline help file.
fr: Help - Ouvre l'aide hors-ligne de AutoHotkey.

source: Help us help you.
fr: Aidez-nous à vous aider.

source: Here are a few more samples:
fr: Quelques exemples supplémentaires :

source: Here are some examples.
fr: Voici quelques exemples.

source: Here are the four most common symbols:
fr: Voici les quatre symboles les plus courants :

source: Here is a simple example on how to ask the user a couple of questions and doing some stuff with what was entered:
fr: Voici un exemple simple de comment poser quelques questions à l'utilisateur et utiliser les réponses :

source: Here is a very basic script containing a hotkey which types text using the Send command when the hotkey is pressed:
fr: Voici un script très simple contenant une hotkey qui écrit du texte en utilisant la commande Send quand la hotkey est utilisée :

source: Here is an example.
fr: Voici un exemple.

source: High impact:
fr: Impact élevé

source: Hip Hip Hooray!
fr: Hip Hip Hip Hourrah!

source: Hold Ctrl or Shift when the installer starts.
fr: Maintenir Ctrl ou Shift quand l'installateur se lance.

source: Home
fr: Début

source: Homepage
fr: Page d'accueil

source: Hopefully this will clear some confusion.
fr: Avec un peu de chance ceci évitera des confusions.

source: Hotkey labels consist of a hotkey followed by double-colon.
fr: Les labels hotkey sont constitués d'une hotkey suivie de deux deux-points.

source: Hotkeys (mouse, joystick and keyboard shortcuts)
fr: Hotkeys (souris, joystick et raccourcis clavier)

source: Hotkeys and their methods - See ListHotkeys.
fr: Hotkeys and their methods (hotkeys et leur méthodes) - Voir ListHotkeys.

source: Hotkeys are also blocked, so for instance, a non-elevated program cannot spy on input intended for an elevated program.
fr: Les hotkeys sont aussi bloquées, donc par exemple, un programme non-élevé ne peut pas espionner les entrées destinées à un programme élevé.

source: Hotkeys, Hotstrings, and Remapping
fr: Hotkeys, Hotstrings, et Réaffectation de Touches

source: Hotkeys/hotstrings don't work when a program running as admin is active.
fr: Les hotkeys/hotstrings ne fonctionnent pas quand un programme exécuté en tant qu'administrateur est actif.

source: Hotstring labels consist of a colon, zero or more options, another colon, an abbreviation and double-colon.
fr: Les labels hotstring sont constitués d'un deux-points, de zéro ou plus options, d'un autre deux-points, d'une abréviation et de deux deux-points.

source: Hotstring modifiers go between the first set of colons.
fr: Les modificateurs pour hostring se situent au milieu de la première paire de deux-points.

source: Hotstrings and auto-replace
fr: Hotstrings et auto-remplacement

source: Hotstrings are mainly used to expand abbreviations as you type them (auto-replace), they can also be used to launch any scripted action.
fr: Les hotstrings sont principalement utilisés pour étendre des abbréviations pendant qu'elles sont tapées (remplacement automatique), et peuvent aussi être utilisés pour lancer toute action scriptée.

source: Hotstrings, as mentioned above, can also launch scripted actions.
fr: Les hotstrings, comme mentionné plus haut, peuvent aussi lancer des actions scriptées.

source: How can MsgBox's button names be changed?
fr: Comment changer le texte des boutons de MsgBox ?

source: How can I change the default editor, which is accessible via context menu or tray icon?
fr: Comment changer l'éditeur par défaut, qui est accessible via le menu contextuel ou l'icône de la zone de notifications ?

source: How can I find and fix errors in my code?
fr: Comment trouver et corriger les erreurs dans mon code ?

source: How can I save the contents of my GUI associated variables?
fr: Comment enregistrer le contenu de mes variables associées à une GUI ?
